Revit 2027 API
SchemaCommon.UIName Property
 The property labeled "UIName" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string UIName { get; }
Public Shared ReadOnly Property UIName As String
	Get
public:
static property String^ UIName {
	String^ get ();
}
static member UIName : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyString".
See Also
Reference
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace